Revit 2024 API
ExternalResourceTypes.BuiltInExternalResourceTypes.SystemsAnalysisReport Property
 An external resource type representing systems analysis report path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalResourceType SystemsAnalysisReport { get; }
Visual Basic
Public Shared ReadOnly Property SystemsAnalysisReport As ExternalResourceType
	Get
Visual C++
public:
static property ExternalResourceType^ SystemsAnalysisReport {
	ExternalResourceType^ get ();
}
See Also
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace